# Parameters
nc: 80  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n-cls.yaml' will call yolov8-cls.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024] # YOLOv8n summary: 225 layers,  3157200 parameters,  3157184 gradients,   8.9 GFLOPs
  s: [0.33, 0.50, 1024] # YOLOv8s summary: 225 layers, 11166560 parameters, 11166544 gradients,  28.8 GFLOPs
  m: [0.67, 0.75, 768] # YOLOv8m summary: 295 layers, 25902640 parameters, 25902624 gradients,  79.3 GFLOPs
  l: [1.00, 1.00, 512] # YOLOv8l summary: 365 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPs
  x: [1.00, 1.25, 512] # YOLOv8x summary: 365 layers, 68229648 parameters, 68229632 gradients, 258.5 GFLOPs

fusion_mode: bifpn
node_mode: HCBR 
head_channel: 256

backbone:
  - [-1, 1, HGStem, [16, 32]]  # 0-P2/4

  - [0, 2, C3k2, [32, False, 0.25]] # 1-P2/4
  - [-1, 1, Conv, [64, 3, 2]] # 2-P3/8
  - [-1, 2, C3k2, [64, False, 0.25]] # 3-P3/8

  - [0, 3, HGBlock, [16, 32, 3]] # 4-P2/4
  - [-1, 1, DWConv, [64, 3, 2, 1, False]]  # 5-P3/8
  - [-1, 3, HGBlock, [32, 64, 3]]   # 6-P3/8

  - [[3, 6], 1, HAFB, [64, True]] # 7-P3/8

  - [7, 1, Conv, [128, 3, 2]]  # 8-P4/16
  - [-1, 2, C3k2, [128, True]] # 9-P4/16

  - [7, 1, DWConv, [128, 3, 2, 1, False]]  # 10-P4/16
  - [-1, 3, HGBlock, [64, 128, 5, True, False]]  #11 cm, c2, k, light, shortcut
  
  - [[9, 11], 1, HAFB, [128, False]] # 12-P4/16

  - [12, 1, Conv, [256, 3, 2]]  # 13-P5/32
  - [-1, 2, C3k2, [256, True]] # 14-P5/32

  - [12, 1, DWConv, [256, 3, 2, 1, False]]  # 15-P5/32
  - [-1, 3, HGBlock, [128, 256, 5, True, False]]  # 16-P5/32

  - [[14, 16], 1, HAFB, [256, False]] # 17-P5/32

# YOLOv8.0n head
head:
  - [7, 1, Conv, [head_channel]]  # 18-P3/8
  - [12, 1, Conv, [head_channel]]  # 19-P4/16
  - [17, 1, Conv, [head_channel]]  # 20-P5/32

  - [19, 1, Conv, [head_channel, 3, 2]] # 21-P5/32
  - [[-1, 20], 1, Fusion, [fusion_mode]] # 22
  - [-1, 3, node_mode, [head_channel, [5,7,9]]] # 23-P5/32

  - [-1, 1, EUCB, []] # 24-P4/16
  - [18, 1, Conv, [head_channel, 3, 2]] # 25-P4/16
  - [[-1, -2, 19], 1, Fusion, [fusion_mode]] # 26
  - [-1, 3, node_mode, [head_channel, [3,5,7]]] # 27-P4/16

  - [-1, 1, EUCB, []] # 28-P3/8
  - [1, 1, Conv, [head_channel, 3, 2]] # 29-P3/8
  - [[-1, -2, 18], 1, Fusion, [fusion_mode]] # 30
  - [-1, 3, node_mode, [head_channel, [1,3,5]]] # 31-P3/8

  - [[31, 27, 23], 1, Detect_Efficient, [nc]] # Detect(P3, P4, P5)